class Dog{
/*js의 그 클래스와 같다 
따라서 이 클래스 안에 작성할 수 있는 언어의 문법 
구성요소 또한 같다, 즉 변수와 함수!!


   int로 직접 자료형을 선언하면 나중에 컴퓨터가 변수의
   타입을 설정하지 않고 바로 실행할 수 있지만, 
   var을 이용 시 나중에 컴퓨터가 사용할 때 마다
   변수형을 판단해야 한다.

   이렇게 계속 판단하는 형식을 인터 프리터라고 한다,
   자바는 한 번 컴파일 시 자료형을 정해두기 때문에
   나중에 명시할 필요가 없다.//나중에 빠름.
   

   //자바 스크립트는 html에 작성해 놓으면 실행부가 위에서부터
   한 줄씩 실행하는 방식, 즉, 브라우저가 있으면 된다.

   자바는 브라우저가 아닌 실행 명령을 개발자가 별도로 호출!!
   
   jdk11 각 종 개발할 수 있는 프로그램이 들어있음(컴파일 프로그램)

   javac.exe//컴파일 하고픈 대상 경로 및 파일명
*/

	String name="뽀미";
	int age=9; //java
}